---
kind: property
id: P:Autodesk.Revit.DB.WorksetId.InvalidWorksetId
source: html/0d2108ef-a296-8205-6487-9493085e4142.htm
---
# Autodesk.Revit.DB.WorksetId.InvalidWorksetId Property

Get the invalid WorksetId whose IntegerValue is -1.

## Syntax (C#)
```csharp
public static WorksetId InvalidWorksetId { get; }
```